#include <iostream>

using namespace std; 

int main() 
{
	setlocale(LC_ALL, "ru");
	cout << "С:\\project\\test.doc\n";
	return 0; 
}

// Вывести на экран следующий текст:  С:\project\test.doc