#include <iostream>

using namespace std;

int main() 
{
	setlocale(LC_ALL, "ru");
    	cout << "Михальчук\n";
	cout << "Александр\n";
	cout << "Александрович\n";
	return 0;
}


// Выведите на экран, Вашу фамилию, имя и отчество, каждое слово с новой строки