#include <iostream>

using namespace std; 

int main() 
{
	setlocale(LC_ALL, "ru");
	cout << "*****************************************\n";
	cout << "*\tЭто моя классная работа\t\t*\n";
	cout << "*****************************************\n";
	return 0; 
}

// Вывести на экран следующий текст:
// ************************************************
// *         Это моя классная работа              *
// ************************************************
