#include <iostream>

using namespace std;

int main() 
{
	setlocale(LC_ALL, "ru");
	cout << "\"Привет программистам\"";
	return 0;
}

// Выведите на экран следующую надпись: «Привет программистам» (двойные кавычки так же вывести на печать).